Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the animation speed.
zh_cn: 给出sprite元素ID(使用layer_sprite_create()创建sprite元素或使用layer_sprite_get_id()函数时获得)，然后设置动画速度。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the blending colour to use.
zh_cn: 你可以给出精灵元素ID(当你使用layer_sprite_create()或layer_sprite_get_id()函数创建精灵元素时获得)，然后设置混合颜色。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the image index to use.
zh_cn: 给出sprite元素ID(使用layer_sprite_create()创建sprite元素或使用layer_sprite_get_id()函数时获得)，然后设置要使用的图像索引。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the scale value.
zh_cn: 你可以给出精灵元素ID(当你使用layer_sprite_create()或layer_sprite_get_id()函数创建精灵元素时获得)，然后设置缩放值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the x value to use (based on the room coordinates).
zh_cn: 你可以给出精灵元素ID(当你使用layer_sprite_create()或layer_sprite_get_id()函数创建精灵元素时获得)，然后设置要使用的x值(基于房间坐标)。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the y value to use (based on the room coordinates).
zh_cn: 给出精灵元素ID(当使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，然后设置要使用的y值(基于房间坐标)。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then supply a sprite index element asset will be changed.
zh_cn: 你提供精灵元素ID(当你使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，然后提供精灵索引元素资源将会改变。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()) as well as the x and y position in the room to get the tile data from and the function will return the tile data "blob".
zh_cn: 你提供tilemap元素ID(当你使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tilemap元素时获得)以及房间中的x和y位置来获取tilemap数据，函数将返回tilemap数据"blob"。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the current mask value or -1 if there is an error or 0 if no mask is specified.
zh_cn: 给出tile map元素ID(使用layer_tilemap_create()创建tile map元素或使用函数layer_tilemap_get_id()时获得)，函数将返回当前掩码值，如果有错误，则返回-1，如果未指定掩码，则返回0。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the frame index.
zh_cn: 给出tile map元素ID(使用layer_tilemap_create()创建tile map元素或使用函数layer_tilemap_get_id()时获得)，函数将返回帧索引。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the height (number of cells wide).
zh_cn: 给出tile map元素ID(使用layer_tilemap_create()创建tile map元素或使用函数layer_tilemap_get_id()时获得)，函数将返回高度(单元格宽度)。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the tile set cell height.
zh_cn: 您可以给出tile map元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tile map元素时获得)，函数将返回图块集单元格高度。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the tile set cell width.
zh_cn: 您可以给出tile map元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tile map元素时获得)，函数将返回图块集单元格宽度。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the tile set index value.
zh_cn: 给出tile map元素ID(使用layer_tilemap_create()创建tile map元素或使用函数layer_tilemap_get_id()时获得)，函数将返回图块集索引值。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the width (number of cells wide).
zh_cn: 您可以给出tilemap元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tilemap元素时获得)，函数将返回宽度(单元格宽度的数量)。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the x-axis position.
zh_cn: 你给出贴图元素ID(当你使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建贴图元素时获得)，函数将返回x轴位置。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the function will return the y-axis position.
zh_cn: 你给出贴图元素ID(当你使用layer_tilemap_create()或者使用layer_tilemap_get_id()函数创建贴图元素时，你会得到它)，函数会返回y轴位置。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the new height of the tile map in tile cells.
zh_cn: 您可以给出瓷砖地图元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建瓷砖地图元素时获得)，以及瓷砖单元格中瓷砖地图的新高度。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and the new width of the tile map in tile cells.
zh_cn: 给出切片地图元素ID(使用layer_tilemap_create()创建切片地图元素或使用layer_tilemap_get_id()函数时获得)，以及切片像元中切片地图的新宽度。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and then set the x value to use (based on the room coordinates).
zh_cn: 给出tile map元素ID(使用layer_tilemap_create()创建tile map元素或使用layer_tilemap_get_id()函数时获得)，然后设置要使用的x值(基于房间坐标)。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and then set the y value to use (based on the room coordinates).
zh_cn: 给出图块地图元素ID(使用layer_tilemap_create()创建图块地图元素或使用layer_tilemap_get_id()函数时获得)，然后设置要使用的y值(基于房间坐标)。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and then supply a tile set index and the tile map will be given the new sprite.
zh_cn: 您给出了tile map元素ID(当您使用layer_tilemap_create()创建tile map元素或使用函数layer_tilemap_get_id()时获得)，然后提供了图块集合索引，tile map将被赋予新的sprite。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and then supply the tile data that you wish to clear the layer with.
zh_cn: 你提供tile map元素ID(当你使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tile map元素时获得)，然后提供你想要清除的图层。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and then the mask value.
zh_cn: 给出tile map元素ID(使用layer_tilemap_create()创建tile map元素或使用函数layer_tilemap_get_id()时获得)，然后指定遮罩值。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and then the tile data to set as well as the position within the room.
zh_cn: 您可以给出贴图元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建贴图元素时获得)，然后是要设置的贴图数据以及房间内的位置。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), and then the tile data to set as well as the position within the tile map.
zh_cn: 您可以给出tilemap元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tilemap元素时获得)，然后是要设置的tile数据以及tilemap中的位置。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), as well as the cell x and y position and the function will return the tile data "blob".
zh_cn: 你给出tilemap元素ID(当你使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tilemap元素时获得)，以及单元格x和y位置，函数将返回tilemap数据"blob"。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), as well as the x and y position within the room and the function will return the x position of the cell within the tile map for that point.
zh_cn: 给出图块tile map元素ID(使用layer_tilemap_create()创建tile map元素或使用函数layer_tilemap_get_id()时获得)，以及房间内的x和y位置，此函数将返回该点在tile map内的单元的x位置。

source: You give the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), as well as the x and y position within the room and the function will return the y position of the cell within the tile map for that point.
zh_cn: 您可以给出tilemap元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tilemap元素时获得)，以及房间内的x和y位置，函数将返回该点的tilemap中单元格的y位置。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and the function will return an integer value for the index or -1 if there is an error.
zh_cn: 给定图块数据，可以使用函数tilemap_get()检索，如果有错误，函数将返回索引的整数值或-1。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and the function will return true if the tile is empty, or false if there is a tile index.
zh_cn: 给定图块数据，可以使用函数tilemap_get()检索，如果tile为空，函数将返回true，如果有tile索引，函数将返回false。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and the function will return true if the tile is flipped, or false if not.
zh_cn: 给定图块数据，可以使用函数tilemap_get()检索，如果tile被翻转，此函数将返回true，否则返回false。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and the function will return true if the tile is mirrored, or false if not.
zh_cn: 您给定图块数据，可以使用函数tilemap_get()检索它，如果tile被镜像，此函数将返回true，否则返回false。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and the function will return true if the tile is rotated, or false if not.
zh_cn: 给定图块数据，可以使用函数tilemap_get()检索，如果tile旋转了，此函数将返回true，否则返回false。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and then set the flip argument to either true if you want the tile flipped, or false if you want the tile to be in its default, un-flipped state.
zh_cn: 此函数可用于设置给定的一组图块数据是否翻转图块。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and then set the mirror argument to either true if you want the tile mirrored, or false if you want the tile to be in its default, un-mirrored state.
zh_cn: 您可以给出瓦片数据(可以使用函数tilemap_get()检索)，然后将mirror参数设置为true(如果希望瓦片镜像)，或false(如果希望瓦片处于默认的非镜像状态)。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and then set the rotate argument to either true if you want the tile rotated, or false if you want the tile to be in its default, un-rotated state.
zh_cn: 给出图块数据，可以使用函数tilemap_get()检索该数据，然后如果希望图块旋转，则将rotate参数设置为true，如果希望图块处于默认的未旋转状态，则将rotate参数设置为false。

source: You give the tile-data, which can be retrieved using the function tilemap_get(), and then the integer value that represents the position of the tile (its index) within the tile set.
zh_cn: 给定图块数据，可以使用函数tilemap_get()检索该数据，然后给定表示图块在图块集中的位置(其索引)的整数值。

source: You give the tilemap element ID (which you get when you create a tilemap element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()), then give the x/y position for drawing (in the room).
zh_cn: 给出tilemap元素ID(使用layer_tilemap_create()创建tilemap元素或使用layer_tilemap_get_id()函数时获得)，然后给出绘图的x/y位置(在房间中)。

source: You give the two arrays to check, and the function will return true if they are equal (either equivalent or the same) or false if they are not.
zh_cn: 您给两个数组进行检查，如果它们相等(等价或相同)，函数将返回true，否则返回false。

source: You give the unique camera ID value (as returned by the different camera_create functions) and the ID of the function to be called.
zh_cn: 您给出惟一的相机ID值(由不同的camera_create函数返回)和要调用的函数的ID。

source: You give the unique camera ID value (as returned by the different camera_create functions) and then give the x border size and the y border size (horizontal and vertical).
zh_cn: 给出唯一的相机ID值(由不同的camera_create函数返回)，然后给出x边界大小和y边界大小(水平和垂直)。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and a projection matrix to be applied.
zh_cn: 给出惟一的相机ID值(由不同的camera_create()函数返回)和要应用的投影矩阵。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and a view matrix to be applied.
zh_cn: 给出唯一的相机ID值(由不同的camera_create()函数返回)和要应用的视图矩阵。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and the ID of the function to be called.
zh_cn: 您给出惟一的相机ID值(由不同的camera_create()函数返回)和要调用的函数的ID。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and then give the angle that you wish to set the camera view to.
zh_cn: 先给出唯一的相机ID值(由不同的camera_create()函数返回)，然后给出希望将相机视图设置为的角度。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and then give the target instance or object ID that you wish to set the camera view to.
zh_cn: 您给出惟一的相机ID值(由不同的camera_create()函数返回)，然后给出您希望设置相机视图的目标实例或对象ID。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and then give the width and height (in pixels) to set the camera to.
zh_cn: 给出惟一的相机ID值(由不同的camera_create()函数返回)，然后给出相机的宽度和高度(以像素为单位)。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and then give the x and y (horizontal and vertical) speed that it should move when set to follow a given instance.
zh_cn: 您给出唯一的相机ID值(由不同的camera_create()函数返回)，然后给出x和y(水平和垂直)速度，当设置为跟随给定实例时，它应该移动。

source: You give the unique camera ID value (as returned by the different camera_create() functions) and then give the x and y positions to set the camera to.
zh_cn: 您给出唯一的相机ID值(由不同的camera_create()函数返回)，然后给出要设置相机的x和y位置。

source: You give the unique layer ID as returned by the function layer_create() or the name of the layer to use as a string - for example "instance_layer" - and then flag the system as being persistent or not.
zh_cn: 你可以给出由layer_create()函数返回的唯一层ID，或者作为字符串使用的层名 -例如"instance_layer"——然后标记系统是否是持久化的。

source: You give the view port index (from 0 to 7) and the new height to use.
zh_cn: 给出视图端口索引(从0到7)和要使用的新高度。

source: You give the view port index (from 0 to 7) and the new position to place it at.
zh_cn: 您将给出视图端口索引(从0到7)和将其放置的新位置。

source: You give the view port index (from 0 to 7) and the new width to use.
zh_cn: 给出视图端口索引(从0到7)和要使用的新宽度。

source: You give the view port to set (from 0 to 7), and supply the unique camera ID value (as returned by the camera_create() functions or when you use view_get_camera()).
zh_cn: 给出要设置的视图端口(从0到7)，并提供唯一的相机ID值(由camera_create()函数返回或在使用view_get_camera()时返回)。

source: You have to have created the sprite to be copied to previously using the sprite_add() or sprite_duplicate() functions.
zh_cn: 您必须已经使用sprite_add()或sprite_duplicate()函数创建了要复制到的sprite。

source: You may (optionally) supply X and Y offset values for the surface being used to add to the GIF, in which case the part drawn to the GIF will begin from the offset and not the default (0,0) position, permitting you to select only a section of the surface to add.
zh_cn: 您可以(可选)为用于添加到GIF的表面提供X和Y偏移值，在这种情况下，绘制到GIF的零件将从偏移而不是默认(0，0)位置开始，允许您仅选择要添加的表面部分。

source: You may also add in a directory to start the search from, and a caption to be shown at the top of the window instead of the default one.
zh_cn: 您还可以添加一个开始搜索的目录，并在窗口顶部显示一个标题，而不是默认的标题。

source: You may also specify an optional argument to set the "clear colour" for the GIF.
zh_cn: 您还可以指定一个可选参数来设置GIF的"透明色"。

source: You may also supply two optional arguments to the function to specify an offset into the array to get the arguments from, as well as the number of arguments to use from the array (this must be a maximum of array_length - offset).
zh_cn: 您还可以向函数提供两个可选参数，以指定要从数组中获取参数的偏移量，以及要从数组中使用的参数数量(这必须是array_length - offset的最大值)。

source: You must also give the light an index number which what will be used in other functions to reference it.
zh_cn: 你还必须给光一个数字索引，这将用于其他函数来引用它。

source: You must also supply a score, and a short text message as well as set the challenge type.
zh_cn: 您还必须提供一个分数，一个简短的文本消息，以及设置挑战类型。

source: You must also supply radius values for the x and y axis (in pixels) and the corners will be rounded by these amounts.
zh_cn: 您还必须提供x轴和y轴的半径值(以像素为单位)，角将按这些值圆化。

source: You must call this first, then define the format values using the appropriate functions, and finally call vertex_format_end() to finish the definition and return the new format "handle".
zh_cn: 您必须首先调用它，然后使用适当的函数定义格式值，最后调用vertex_format_end()来完成定义并返回新的格式"handle"。

source: You must define the socket protocol (see the list of constants below) and give a port to use, and the function will return a unique id which should be used in all further function calls for that socket, or a value of less than 0 if the connection fails.
zh_cn: 您必须定义套接字协议(参见下面的常量列表)并给出要使用的端口，函数将返回一个惟一的id，该id应该在该套接字的所有后续函数调用中使用，或者在连接失败时返回一个小于0的值。

source: You must define the socket type (see the list of constants below) and the function will return a unique id for that socket, which should be used in all further function calls for that socket, or a value of less than 0 if the connection fails.
zh_cn: 您必须定义套接字类型(参见下面的常量列表)，函数将为该套接字返回一个惟一的id，该id应该在该套接字的所有后续函数调用中使用，或者在连接失败时返回一个小于0的值。

source: You must first create a new DS list to read the string into, and if the DS list already exists and has information stored in it, then this will be cleared before reading.
zh_cn: 您必须首先创建一个新的DS列表来读取字符串，如果DS列表已经存在并且其中存储了信息，那么在读取之前将会清除该列表。

source: You must first create a new DS priority to read the string into, and if the DS priority already exists and has information stored in it, then this will be cleared before reading.
zh_cn: 您必须首先创建一个新的DS优先级来将字符串读入其中，如果DS优先级已经存在并在其中存储了信息，那么将在读取之前清除此优先级。

source: You must first create a new DS queue to read the string into, and if the DS queue already exists and has information stored in it, then this will be cleared before reading.
zh_cn: 您必须首先创建一个新的DS队列来读取字符串，如果DS队列已经存在并且在其中存储了信息，那么在读取之前将会清除该队列。

source: You must first create a new DS stack to read the string into, and if the DS stack already exists and has information stored in it, then this will be cleared before reading.
zh_cn: 您必须首先创建一个新的DS堆栈来读取字符串，如果DS堆栈已经存在并且其中存储了信息，那么在读取之前将会清除该堆栈。

source: You must first have begun the group definition using the function physics_particle_group_begin(), and then you would use this function to set the approximate half width and half height of the group in pixels - approximate because the exact width and height will depend on the size of the base particles, as defined by the physics_particle_set_radius() function, as the physics simulation tries to "fit" as many of the particles as possible into the defined shape.
zh_cn: 必须首先使用函数physics_particle_group_begin()开始组定义，然后使用此函数以像素为单位设置组的近似半宽和半高，因为精确的宽度和高度将取决于基本粒子的大小，如physics_particle_set_radius()函数所定义的，因为物理模拟会尝试将尽可能多的粒子"适合"定义的形状。

source: You must first have begun the group definition using the function physics_particle_group_begin(), and then you would use this function to set the approximate radius of the group in pixels - approximate because the exact radius will depend on the size of the base particles, as defined by the physics_particle_set_radius() function, as the physics simulation tries to "fit" as many of the particles as possible into the defined shape.
zh_cn: 您必须首先使用函数physics_particle_group_begin()开始组定义，然后使用此函数以像素为单位设置组的近似半径-近似，因为精确的半径将取决于基本粒子的大小，如physics_particle_set_radius()函数所定义的，因为物理模拟试图将尽可能多的粒子"适合"定义的形状。

source: You must first have begun the group definition using the function physics_particle_group_begin(), and then you would use this function to tell GameMaker that you are going to add in the approximate points that will be used to define the polygon shape - approximate because the exact shape will depend on the size of the base particles, as defined by the physics_particle_set_radius() function, as the physics simulation tries to "fit" as many of the particles as possible into the defined shape.
zh_cn: 你必须首先开始组定义使用函数physics_particle_group_begin(),然后您将使用此函数告诉GameMaker你要加入的近似点用于定义多边形形状——大概是因为精确的形状取决于基本粒子的大小,定义的physics_particle_set_radius()函数,物理模拟试图"适合"尽可能多的粒子的成定义的形状。

source: You must give at least three points when defining the polygon shape, but can give up to eight, and the function will permit the definition of concave polygons.
zh_cn: 在定义多边形形状时，您必须给出至少3个点，但最多可以给出8个点，并且此函数将允许定义凹多边形。

source: You must give the kind of primitive to use (see draw_primitive_begin() for more information) and the id of a texture to use, which can be a sprite or background image asset.
zh_cn: 您必须给出要使用的图元的种类(有关更多信息，请参见draw_primitive_begin())和要使用的纹理的id，它可以是精灵或背景图像资源。

source: You must have previously called the function buffer_async_group_begin() to initiate the group, then call the function buffer_save_async() for each file that you wish to save out.
zh_cn: 您必须在之前调用函数buffer_async_group_begin()来初始化组，然后为您希望保存的每个文件调用函数buffer_save_async()。

source: You must have previously signaled to GameMaker that you are going define a polygon shape using the function physics_particle_group_polygon() and then use this function to define the individual points of the polygon.
zh_cn: 你必须事先通知GameMaker，你将使用physics_particle_group_polygon()函数定义一个多边形形状，然后使用此函数定义多边形的各个点。

source: You must previously have gotten the "handle" of the constant using the function shader_get_uniform(), and you will have to have previously initialised the array.
zh_cn: 您必须事先使用函数shader_get_uniform()获得常量的"句柄"，并且必须事先初始化该数组。

source: You must previously have gotten the "handle" of the constant using the function shader_get_uniform(), and you will have to have previously initialised the buffer and filled it with buffer_f32 data.
zh_cn: 您之前必须使用函数 shader_get_uniform() 获得常量的“句柄”，并且您必须事先初始化缓冲区并用 buffer_f32 数据填充它。

source: You must previously have gotten the "handle" of the constant using the function shader_get_uniform(), and you will have to know what type of constant it is to pass the correct number of floating point values through to it, ie: if you have a vec2 you will need to pass two values to the function.
zh_cn: 你必须事先使用shader_get_uniform()函数获得常量的"句柄"，你必须知道它是什么类型的常量，通过它传递正确的浮点值的数量，即:如果你有一个vec2，你将需要传递两个值给函数。
